{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "roberta-base",
  "beta1": 0.85,
  "beta2": 0.85,
  "bias": "none",
  "corda_config": null,
  "deltaT": 10,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "init_r": 12,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": [
    "classifier",
    "score"
  ],
  "orth_reg_weight": 0.5,
  "peft_type": "ADALORA",
  "qalora_group_size": 16,
  "r": 8,
  "rank_pattern": null,
  "revision": null,
  "target_modules": [
    "dense",
    "value",
    "query",
    "key"
  ],
  "target_parameters": null,
  "target_r": 4,
  "task_type": "SEQ_CLS",
  "tfinal": 500,
  "tinit": 100,
  "total_step": 1000,
  "trainable_token_indices": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}